tocache/Microchip-PIC18F4550/UPC Microcontroladores 2019-2/Semana 10/test_servo.X/maincodemon3pos.c
//Este es un comentario
/*Este es otro comentario*/

// PIC18F4550 Configuration Bit Settings
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config FOSC = XTPLL_XT  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)


#include <xc.h>
#define _XTAL_FREQ 48000000UL   // Frecuencia de trabajo del microcontrolador

unsigned int Periodon(tiempo){
    for(unsigned int papa=0; papa<tiempo; papa++){
        __delay_us(1);
    }
}
void main(void) {
    TRISDbits.RD0 = 0;           //Salida para controlar el servomecanismo
    while(1){
        if(PORTBbits.RB1 == 0 && PORTBbits.RB0 == 0){
            LATDbits.LD0 = 1;
            Periodon(800);
            //__delay_us(1500);
            LATDbits.LD0 = 0;
            Periodon(10000);
//            __delay_us(500);
//            __delay_ms(18);
        }
        else if(PORTBbits.RB1 == 0 && PORTBbits.RB0 == 1){
            LATDbits.LD0 = 1;
            __delay_us(1000);
            LATDbits.LD0 = 0;
            __delay_ms(19);            
        }
        else if(PORTBbits.RB1 == 1 && PORTBbits.RB0 == 0){
            LATDbits.LD0 = 1;
            __delay_us(2000);
            LATDbits.LD0 = 0;
            __delay_ms(18);            
        }        
        else{
            LATDbits.LD0 = 0;
        }
    }
}
